read_verilog src/i2c_generator.v
read_verilog src/i2c_receiver.v
read_verilog src/top.v

# Point synthesis directly to our wrapper
hierarchy -check -top top

proc; opt; fsm; opt; memory; opt

techmap; opt

# Map flipflops and logic
dfflibmap -liberty syn/cmos_cells.lib
abc -liberty syn/cmos_cells.lib

show top
clean

write_verilog build/i2c_synth.v

# Resource use:
stat -liberty syn/cmos_cells.lib